# Поиск закономерностей в развитии компьютерных игр

**Цель исследования** - произвести различные выгрузки данных венчурных фондов с помощью SQL.

**Описание данных**  - база данных, которая хранит информацию о венчурных фондах и инвестициях в компании-стартапы. Эта база данных основана на датасете Startup Investments, опубликованном на популярной платформе для соревнований по исследованию данных Kaggle.

**acquisition** - cодержит информацию о покупках одних компаний другими. Таблица включает такие поля:

- первичный ключ id — идентификатор или уникальный номер покупки;
- внешний ключ acquiring_company_id — ссылается на таблицу company — идентификатор компании-покупателя, то есть той, что покупает другую компанию;
- внешний ключ acquired_company_id — ссылается на таблицу company — идентификатор компании, которую покупают;
- term_code — способ оплаты сделки:
- cash — наличными;
- stock — акциями компании;
- cash_and_stock — смешанный тип оплаты: наличные и акции.
- price_amount — сумма покупки в долларах;
- acquired_at — дата совершения сделки;
- created_at — дата и время создания записи в таблице;
- updated_at — дата и время обновления записи в таблице.

---

**company** - cодержит информацию о компаниях-стартапах.

- первичный ключ id — идентификатор, или уникальный номер компании;
- name — название компании;
- category_code — категория деятельности компании, например:
- news — специализируется на работе с новостями;
- social — специализируется на социальной работе.
- status — статус компании:
- acquired — приобретена;
- operating — действует;
- ipo — вышла на IPO;
- closed — перестала существовать.
- founded_at — дата основания компании;
- closed_at — дата закрытия компании, которую указывают в том случае, если компании больше не существует;
- domain — домен сайта компании;
- twitter_username — название профиля компании в твиттере;
- country_code — код страны, например, USA для США, GBR для Великобритании;
- investment_rounds — число раундов, в которых компания участвовала как инвестор;
- funding_rounds — число раундов, в которых компания привлекала инвестиции;
- funding_total — сумма привлечённых инвестиций в долларах;
- milestones — количество важных этапов в истории компании;
- created_at — дата и время создания записи в таблице;
- updated_at — дата и время обновления записи в таблице.

---

**education** - хранит информацию об уровне образования сотрудников компаний.

первичный ключ id — уникальный номер записи с информацией об образовании;
внешний ключ person_id — ссылается на таблицу people — идентификатор человека, информация о котором представлена в записи;
degree_type — учебная степень, например:
BA — Bachelor of Arts — бакалавр гуманитарных наук;
MS — Master of Science — магистр естественных наук.
instituition — учебное заведение, название университета;
graduated_at — дата завершения обучения, выпуска;
created_at — дата и время создания записи в таблице;
updated_at — дата и время обновления записи в таблице.

---

**fund** - хранит информацию о венчурных фондах.

- первичный ключ id — уникальный номер венчурного фонда;
- name — название венчурного фонда;
- founded_at — дата основания фонда;
- domain — домен сайта фонда;
- twitter_username — профиль фонда в твиттере;
- country_code — код страны фонда;
- investment_rounds — число инвестиционных раундов, в которых фонд принимал участие;
- invested_companies — число компаний, в которые инвестировал фонд;
- milestones — количество важных этапов в истории фонда;
- created_at — дата и время создания записи в таблице;
- updated_at — дата и время обновления записи в таблице.

---

**funding_round** - содержит информацию о раундах инвестиций.

- первичный ключ id — уникальный номер инвестиционного раунда;
- внешний ключ company_id — ссылается на таблицу company — уникальный номер компании, участвовавшей в инвестиционном раунде;
- funded_at — дата проведения раунда;
- funding_round_type — тип инвестиционного раунда, например:
- venture — венчурный раунд;
- angel — ангельский раунд;
- series_a — раунд А.
- raised_amount — сумма инвестиций, которую привлекла компания в этом раунде в долларах;
- pre_money_valuation — предварительная, проведённая до инвестиций оценка стоимости компании в долларах;
- participants — количество участников инвестиционного раунда;
- is_first_round — является ли этот раунд первым для компании;
- is_last_round — является ли этот раунд последним для компании;
- created_at — дата и время создания записи в таблице;
- updated_at — дата и время обновления записи в таблице.

---

**investment** - содержит информацию об инвестициях венчурных фондов в компании-стартапы.

- первичный ключ id — уникальный номер инвестиции;
- внешний ключ funding_round_id — ссылается на таблицу funding_round — уникальный номер раунда инвестиции;
- внешний ключ company_id — ссылается на таблицу company — уникальный номер компании-стартапа, в которую инвестируют;
- внешний ключ fund_id — ссылается на таблицу fund — уникальный номер фонда, инвестирующего в компанию-стартап;
- created_at — дата и время создания записи в таблице;
- updated_at — дата и время обновления записи в таблице.

---

**people** - содержит информацию о сотрудниках компаний-стартапов.

- первичный ключ id — уникальный номер сотрудника;
- first_name — имя сотрудника;
- last_name — фамилия сотрудника;
- внешний ключ company_id — ссылается на таблицу company — уникальный номер компании-стартапа;
- twitter_username — профиль сотрудника в твиттере;
- created_at — дата и время создания записи в таблице;
- updated_at — дата и время обновления записи в таблице.

<div align='right'>Проектную работу выполнил студент Гагиев Денис. </div>

## ВЫПОЛНЕННЫЕ ЗАДАНИЯ:

**Задание 1**  - Посчитайте, сколько компаний закрылось.

In [5]:
'''
SELECT COUNT(id)
FROM company
WHERE status LIKE '%closed%
'''

"\nSELECT\n    COUNT(id)\nFROM \n    company\nWHERE \n    status LIKE '%closed%\n"

**Задание 2**  - Отобразите количество привлечённых средств для новостных компаний США. Используйте данные из таблицы company. Отсортируйте таблицу по убыванию значений в поле funding_total .

In [7]:
'''
SELECT funding_total
FROM company
WHERE category_code = 'news' AND country_code = 'USA'
ORDER BY funding_total DESC
'''

"\nSELECT funding_total\nFROM company\nWHERE category_code = 'news' AND country_code = 'USA'\nORDER BY funding_total DESC\n"

**Задание 3**  - Найдите общую сумму сделок по покупке одних компаний другими в долларах. Отберите сделки, которые осуществлялись только за наличные с 2011 по 2013 год включительно.

In [5]:
'''
SELECT SUM(price_amount)
FROM acquisition
WHERE term_code = 'cash'
      AND EXTRACT(YEAR FROM CAST(acquired_at AS DATE)) IN ('2011', '2012', '2013')
'''

"\nSELECT\n    COUNT(id)\nFROM \n    company\nWHERE \n    status LIKE '%closed%\n"

**Задание 4**  - Отобразите имя, фамилию и названия аккаунтов людей в твиттере, у которых названия аккаунтов начинаются на 'Silver'.

In [9]:
'''
SELECT
    first_name,
    last_name,
    twitter_username
FROM people
WHERE twitter_username LIKE 'Silver%'
'''

"\nSELECT\n    first_name,\n    last_name,\n    twitter_username\nFROM people\nWHERE twitter_username LIKE 'Silver%'\n"

**Задание 5**  - Выведите на экран всю информацию о людях, у которых названия аккаунтов в твиттере содержат подстроку 'money', а фамилия начинается на 'K'.

In [8]:
'''
SELECT *
FROM people
WHERE twitter_username LIKE '%money%' AND last_name LIKE 'K%'
'''

"\nSELECT *\nFROM people\nWHERE twitter_username LIKE '%money%' AND last_name LIKE 'K%'\n"

**Задание 6**  - Для каждой страны отобразите общую сумму привлечённых инвестиций, которые получили компании, зарегистрированные в этой стране. Страну, в которой зарегистрирована компания, можно определить по коду страны. Отсортируйте данные по убыванию суммы.

In [10]:
'''
SELECT
    country_code,
    SUM(funding_total)
FROM company
GROUP BY country_code
ORDER BY SUM(funding_total) DESC
'''

'\nSELECT\n    country_code,\n    SUM(funding_total)\nFROM company\nGROUP BY country_code\nORDER BY SUM(funding_total) DESC\n'

**Задание 7**  - Составьте таблицу, в которую войдёт дата проведения раунда, а также минимальное и максимальное значения суммы инвестиций, привлечённых в эту дату.
Оставьте в итоговой таблице только те записи, в которых минимальное значение суммы инвестиций не равно нулю и не равно максимальному значению.

In [11]:
'''
SELECT
    funded_at,
    MIN(raised_amount),
    MAX(raised_amount) 
FROM funding_round
GROUP BY funded_at
HAVING MIN(raised_amount) != 0 AND MIN(raised_amount) !=  MAX(raised_amount)
'''

'\nSELECT\n    funded_at,\n    MIN(raised_amount),\n    MAX(raised_amount) \nFROM funding_round\nGROUP BY funded_at\nHAVING MIN(raised_amount) != 0 AND MIN(raised_amount) !=  MAX(raised_amount)\n'

**Задание 8**  - Создайте поле с категориями:
- Для фондов, которые инвестируют в 100 и более компаний, назначьте категорию high_activity.
- Для фондов, которые инвестируют в 20 и более компаний до 100, назначьте категорию middle_activity.
- Если количество инвестируемых компаний фонда не достигает 20, назначьте категорию low_activity.  

Отобразите все поля таблицы fund и новое поле с категориями.

In [12]:
'''
SELECT *,
CASE
    WHEN invested_companies > 100 THEN 'high_activity'
    WHEN invested_companies BETWEEN '20' AND '100' THEN 'middle_activity'
    WHEN invested_companies < 20 THEN 'low_activity'
END
FROM fund
'''

"\nSELECT *,\nCASE\n    WHEN invested_companies > 100 THEN 'high_activity'\n    WHEN invested_companies BETWEEN '20' AND '100' THEN 'middle_activity'\n    WHEN invested_companies < 20 THEN 'low_activity'\nEND\nFROM fund\n"

**Задание 9**  - Для каждой из категорий, назначенных в предыдущем задании, посчитайте округлённое до ближайшего целого числа среднее количество инвестиционных раундов, в которых фонд принимал участие. Выведите на экран категории и среднее число инвестиционных раундов. Отсортируйте таблицу по возрастанию среднего.

In [13]:
'''
SELECT
       CASE
           WHEN invested_companies>=100 THEN 'high_activity'
           WHEN invested_companies>=20 THEN 'middle_activity'
           ELSE 'low_activity'
       END AS activity,
       ROUND(AVG(investment_rounds))
FROM fund
GROUP BY activity
ORDER BY round;
'''

"\nSELECT\n       CASE\n           WHEN invested_companies>=100 THEN 'high_activity'\n           WHEN invested_companies>=20 THEN 'middle_activity'\n           ELSE 'low_activity'\n       END AS activity,\n       ROUND(AVG(investment_rounds))\nFROM fund\nGROUP BY activity\nORDER BY round;\n"

**Задание 10**  - Проанализируйте, в каких странах находятся фонды, которые чаще всего инвестируют в стартапы. 

Для каждой страны посчитайте минимальное, максимальное и среднее число компаний, в которые инвестировали фонды этой страны, основанные с 2010 по 2012 год включительно. Исключите страны с фондами, у которых минимальное число компаний, получивших инвестиции, равно нулю. 

Выгрузите десять самых активных стран-инвесторов: отсортируйте таблицу по среднему количеству компаний от большего к меньшему. Затем добавьте сортировку по коду страны в лексикографическом порядке.

In [14]:
'''
SELECT
    country_code,
    MIN(invested_companies),
    MAX(invested_companies),
    AVG(invested_companies)
FROM fund
WHERE EXTRACT(YEAR FROM CAST(founded_at AS DATE)) IN ('2010', '2011', '2012')
GROUP BY country_code
HAVING MIN(invested_companies) > 0
ORDER BY AVG(invested_companies) DESC, country_code
LIMIT 10
'''

"\nSELECT\n    country_code,\n    MIN(invested_companies),\n    MAX(invested_companies),\n    AVG(invested_companies)\nFROM fund\nWHERE EXTRACT(YEAR FROM CAST(founded_at AS DATE)) IN ('2010', '2011', '2012')\nGROUP BY country_code\nHAVING MIN(invested_companies) > 0\nORDER BY AVG(invested_companies) DESC, country_code\nLIMIT 10\n"

**Задание 11**  - Отобразите имя и фамилию всех сотрудников стартапов. Добавьте поле с названием учебного заведения, которое окончил сотрудник, если эта информация известна.

In [15]:
'''
SELECT
    p.first_name,
    p.last_name,
    ed.instituition
FROM people as p LEFT JOIN education as ed on p.id = ed.person_id
'''

'\nSELECT\n    p.first_name,\n    p.last_name,\n    ed.instituition\nFROM people as p LEFT JOIN education as ed on p.id = ed.person_id\n'

**Задание 12**  - Для каждой компании найдите количество учебных заведений, которые окончили её сотрудники. Выведите название компании и число уникальных названий учебных заведений. Составьте топ-5 компаний по количеству университетов.

In [16]:
'''
SELECT
    com.name,
    COUNT(DISTINCT(ed.instituition))
FROM company as com INNER JOIN people as pe on com.id=pe.company_id
     INNER JOIN education as ed ON pe.id = ed.person_id
GROUP BY com.name
ORDER BY COUNT(DISTINCT(ed.instituition)) DESC 
LIMIT 5
'''

'\nSELECT\n    com.name,\n    COUNT(DISTINCT(ed.instituition))\nFROM company as com INNER JOIN people as pe on com.id=pe.company_id\n     INNER JOIN education as ed ON pe.id = ed.person_id\nGROUP BY com.name\nORDER BY COUNT(DISTINCT(ed.instituition)) DESC \nLIMIT 5\n'

**Задание 13**  - Составьте список с уникальными названиями закрытых компаний, для которых первый раунд финансирования оказался последним.

In [18]:
'''
SELECT
    DISTINCT(co.name)
FROM company AS co LEFT JOIN funding_round as fr on co.id = fr.company_id
WHERE co.status = 'closed' AND fr.is_first_round = 1 and is_last_round = 1
'''

"\nSELECT\n    DISTINCT(co.name)\nFROM company AS co LEFT JOIN funding_round as fr on co.id = fr.company_id\nWHERE co.status = 'closed' AND fr.is_first_round = 1 and is_last_round = 1\n"

**Задание 14**  - Составьте список уникальных номеров сотрудников, которые работают в компаниях, отобранных в предыдущем задании.

In [19]:
'''
SELECT
    DISTINCT(id)
FROM people
WHERE company_id IN (
    SELECT
        co.id
    FROM company AS co LEFT JOIN funding_round as fr on co.id = fr.company_id
    WHERE co.status = 'closed' AND fr.is_first_round = '1' AND is_last_round = '1'
    )
'''

"\nSELECT\n    DISTINCT(id)\nFROM people\nWHERE company_id IN (\n    SELECT\n        co.id\n    FROM company AS co LEFT JOIN funding_round as fr on co.id = fr.company_id\n    WHERE co.status = 'closed' AND fr.is_first_round = '1' AND is_last_round = '1'\n    )\n"

**Задание 15**  - Составьте таблицу, куда войдут уникальные пары с номерами сотрудников из предыдущей задачи и учебным заведением, которое окончил сотрудник.

In [20]:
'''
SELECT
    DISTINCT(pe.id),
    ed.instituition
FROM people AS pe RIGHT JOIN education AS ed on pe.id=ed.person_id
WHERE pe.company_id IN (SELECT
           co.id
       FROM company AS co LEFT JOIN funding_round AS fr ON co.id = fr.company_id
      WHERE co.status = 'closed' AND fr.is_first_round = '1' AND fr.is_last_round = '1')
'''

"\nSELECT\n    DISTINCT(pe.id),\n    ed.instituition\nFROM people AS pe RIGHT JOIN education AS ed on pe.id=ed.person_id\nWHERE pe.company_id IN (SELECT\n           co.id\n       FROM company AS co LEFT JOIN funding_round AS fr ON co.id = fr.company_id\n      WHERE co.status = 'closed' AND fr.is_first_round = '1' AND fr.is_last_round = '1')\n"

**Задание 16**  - Посчитайте количество учебных заведений для каждого сотрудника из предыдущего задания. При подсчёте учитывайте, что некоторые сотрудники могли окончить одно и то же заведение дважды.

In [22]:
'''
SELECT
    DISTINCT(pe.id) AS id_people,
    COUNT(ed.instituition)
FROM people AS pe RIGHT JOIN education AS ed ON pe.id=ed.person_id
WHERE pe.company_id IN (
    SELECT
        com.id
    FROM company AS com LEFT JOIN funding_round AS fr ON com.id=fr.company_id
        WHERE com.status = 'closed' AND fr.is_first_round = '1' AND fr.is_last_round = '1')
GROUP BY id_people
'''

"\nSELECT\n    DISTINCT(pe.id) AS id_people,\n    COUNT(ed.instituition)\nFROM people AS pe RIGHT JOIN education AS ed ON pe.id=ed.person_id\nWHERE pe.company_id IN (\n    SELECT\n        com.id\n    FROM company AS com LEFT JOIN funding_round AS fr ON com.id=fr.company_id\n        WHERE com.status = 'closed' AND fr.is_first_round = '1' AND fr.is_last_round = '1')\nGROUP BY id_people\n"

**Задание 17**  - Дополните предыдущий запрос и выведите среднее число учебных заведений (всех, не только уникальных), которые окончили сотрудники разных компаний. Нужно вывести только одну запись, группировка здесь не понадобится.

In [24]:
'''
SELECT
    AVG(tabl.count_in)
FROM 
    (SELECT
        DISTINCT(pe.id) AS id_people,
        COUNT(ed.instituition) as count_in
    FROM people AS pe RIGHT JOIN education AS ed ON pe.id=ed.person_id
    WHERE pe.company_id IN (
        SELECT
            com.id
        FROM company AS com LEFT JOIN funding_round AS fr ON com.id=fr.company_id
            WHERE com.status = 'closed' AND fr.is_first_round = '1' AND fr.is_last_round = '1')
    GROUP BY id_people) AS tabl
'''

"\nSELECT\n    AVG(tabl.count_in)\nFROM \n    (SELECT\n        DISTINCT(pe.id) AS id_people,\n        COUNT(ed.instituition) as count_in\n    FROM people AS pe RIGHT JOIN education AS ed ON pe.id=ed.person_id\n    WHERE pe.company_id IN (\n        SELECT\n            com.id\n        FROM company AS com LEFT JOIN funding_round AS fr ON com.id=fr.company_id\n            WHERE com.status = 'closed' AND fr.is_first_round = '1' AND fr.is_last_round = '1')\n    GROUP BY id_people) AS tabl\n"

**Задание 18**  - Напишите похожий запрос: выведите среднее число учебных заведений (всех, не только уникальных), которые окончили сотрудники Facebook*.  
*(сервис, запрещённый на территории РФ)

In [25]:
'''
SELECT
    AVG(tabl.count_in)
FROM  
    (SELECT
        DISTINCT(pe.id) AS id_people,
        COUNT(ed.instituition) count_in
    FROM education AS ed LEFT JOIN people AS pe ON ed.person_id = pe.id
    WHERE pe.company_id IN 
        (SELECT
             id
         FROM company
         WHERE name = 'Facebook'
        )
    GROUP BY id_people) AS tabl
'''

"\nSELECT\n    AVG(tabl.count_in)\nFROM  \n    (SELECT\n        DISTINCT(pe.id) AS id_people,\n        COUNT(ed.instituition) count_in\n    FROM education AS ed LEFT JOIN people AS pe ON ed.person_id = pe.id\n    WHERE pe.company_id IN \n        (SELECT\n             id\n         FROM company\n         WHERE name = 'Facebook'\n        )\n    GROUP BY id_people) AS tabl\n"

**Задание 19**  - 
Составьте таблицу из полей:
- name_of_fund — название фонда;
- name_of_company — название компании;
- amount — сумма инвестиций, которую привлекла компания в раунде.

В таблицу войдут данные о компаниях, в истории которых было больше шести важных этапов, а раунды финансирования проходили с 2012 по 2013 год включительно.

In [26]:
'''
SELECT
    f.name AS name_of_fund,
    com.name AS name_of_company,
    fr.raised_amount AS amount
FROM investment AS inv
    LEFT JOIN fund AS f ON inv.fund_id = f.id
    LEFT JOIN company AS com ON com.id = inv.company_id
    LEFT JOIN funding_round AS fr ON inv.funding_round_id = fr.id
WHERE EXTRACT(YEAR FROM CAST(funded_at AS DATE)) IN ('2012', '2013')
    AND com.milestones > 6
'''

"\nSELECT\n    f.name AS name_of_fund,\n    com.name AS name_of_company,\n    fr.raised_amount AS amount\nFROM investment AS inv\n    LEFT JOIN fund AS f ON inv.fund_id = f.id\n    LEFT JOIN company AS com ON com.id = inv.company_id\n    LEFT JOIN funding_round AS fr ON inv.funding_round_id = fr.id\nWHERE EXTRACT(YEAR FROM CAST(funded_at AS DATE)) IN ('2012', '2013')\n    AND com.milestones > 6\n"

**Задание 20**  - Выгрузите таблицу, в которой будут такие поля:
- название компании-покупателя;
- сумма сделки;
- название компании, которую купили;
- сумма инвестиций, вложенных в купленную компанию;
- доля, которая отображает, во сколько раз сумма покупки превысила сумму вложенных в компанию инвестиций, округлённая до ближайшего целого числа.

Не учитывайте те сделки, в которых сумма покупки равна нулю. Если сумма инвестиций в компанию равна нулю, исключите такую компанию из таблицы. 
Отсортируйте таблицу по сумме сделки от большей к меньшей, а затем по названию купленной компании в лексикографическом порядке. Ограничьте таблицу первыми десятью записями.

In [27]:
'''
SELECT
    com.name,
    ac.price_amount,
    com_two.name,
    com_two.funding_total,
    round(ac.price_amount/com_two.funding_total)
FROM acquisition AS ac 
     JOIN company AS com ON ac.acquiring_company_id = com.id
     JOIN company AS com_two ON ac.acquired_company_id = com_two.id
WHERE ac.price_amount != 0 and com_two.funding_total != 0
ORDER BY ac.price_amount DESC, com_two.name
LIMIT 10
'''

'\nSELECT\n    com.name,\n    ac.price_amount,\n    com_two.name,\n    com_two.funding_total,\n    round(ac.price_amount/com_two.funding_total)\nFROM acquisition AS ac \n     JOIN company AS com ON ac.acquiring_company_id = com.id\n     JOIN company AS com_two ON ac.acquired_company_id = com_two.id\nWHERE ac.price_amount != 0 and com_two.funding_total != 0\nORDER BY ac.price_amount DESC, com_two.name\nLIMIT 10\n'

**Задание 21**  - Выгрузите таблицу, в которую войдут названия компаний из категории social, получившие финансирование с 2010 по 2013 год включительно. Проверьте, что сумма инвестиций не равна нулю. Выведите также номер месяца, в котором проходил раунд финансирования.

In [30]:
'''
SELECT
    com.name,
    EXTRACT(MONTH FROM CAST(fr.funded_at AS DATE))
FROM company AS com LEFT JOIN funding_round AS fr ON com.id = fr.company_id
WHERE com.category_code = 'social' AND EXTRACT(YEAR FROM CAST(fr.funded_at AS DATE)) IN ('2010', '2011', '2012', '2013') 
    AND fr.raised_amount != 0
'''

"\nSELECT\n    com.name,\n    EXTRACT(MONTH FROM CAST(fr.funded_at AS DATE))\nFROM company AS com LEFT JOIN funding_round AS fr ON com.id = fr.company_id\nWHERE com.category_code = 'social' AND EXTRACT(YEAR FROM CAST(fr.funded_at AS DATE)) IN ('2010', '2011', '2012', '2013') \n    AND fr.raised_amount != 0\n"

**Задание 22**  - Отберите данные по месяцам с 2010 по 2013 год, когда проходили инвестиционные раунды. Сгруппируйте данные по номеру месяца и получите таблицу, в которой будут поля:
- номер месяца, в котором проходили раунды;
- количество уникальных названий фондов из США, которые инвестировали в этом месяце;
- количество компаний, купленных за этот месяц;
- общая сумма сделок по покупкам в этом месяце.

In [ ]:
'''
WITH
one AS (
    SELECT
        EXTRACT(MONTH FROM CAST(fr.funded_at AS DATE)) AS month_fund,
        COUNT(DISTINCT(f.name)) AS count_founds
    FROM funding_round AS fr
        LEFT JOIN investment AS inv ON fr.id = inv.funding_round_id
        LEFT JOIN fund AS f ON f.id = inv.fund_id
    WHERE
        EXTRACT(YEAR FROM CAST(fr.funded_at AS DATE)) BETWEEN 2010 AND 2013
        AND f.country_code = 'USA'
    GROUP BY month_fund),
two AS (
    SELECT
        EXTRACT(MONTH FROM CAST(acquired_at AS DATE)) AS month_acq,
        COUNT(acquired_company_id) AS count_acquired_company,
        SUM(price_amount) AS sum_price
    FROM acquisition
    WHERE EXTRACT(YEAR FROM CAST(acquired_at AS DATE)) BETWEEN 2010 AND 2013
    GROUP BY month_acq
)

SELECT
    one.month_fund AS month,
    one.count_founds,
    two.count_acquired_company,
    two.sum_price
FROM one JOIN two ON one.month_fund = two.month_acq
'''

**Задание 23**  - Составьте сводную таблицу и выведите среднюю сумму инвестиций для стран, в которых есть стартапы, зарегистрированные в 2011, 2012 и 2013 годах. Данные за каждый год должны быть в отдельном поле. Отсортируйте таблицу по среднему значению инвестиций за 2011 год от большего к меньшему.

In [31]:
'''
WITH
year_2011 AS (
    SELECT
        country_code AS country,
        AVG(funding_total) AS avg_2011
    FROM company
    WHERE EXTRACT(YEAR FROM CAST(founded_at AS DATE)) = '2011'
    GROUP BY country),
year_2012 AS (
    SELECT
        country_code AS country,
        AVG(funding_total) AS avg_2012
    FROM company
    WHERE EXTRACT(YEAR FROM CAST(founded_at AS DATE)) = '2012'
    GROUP BY country),
year_2013 AS (
    SELECT
        country_code AS country,
        AVG(funding_total) AS avg_2013
    FROM company
    WHERE EXTRACT(YEAR FROM CAST(founded_at AS DATE)) = '2013'
    GROUP BY country)

SELECT
    year_2011.country,
    year_2011.avg_2011,
    year_2012.avg_2012,
    year_2013.avg_2013
FROM year_2011 
     JOIN year_2012 ON year_2011.country = year_2012.country
     JOIN year_2013 ON year_2011.country = year_2013.country
ORDER BY year_2011.avg_2011 DESC
'''

"\nWITH\nyear_2011 AS (\n    SELECT\n        country_code AS country,\n        AVG(funding_total) AS avg_2011\n    FROM company\n    WHERE EXTRACT(YEAR FROM CAST(founded_at AS DATE)) = '2011'\n    GROUP BY country),\nyear_2012 AS (\n    SELECT\n        country_code AS country,\n        AVG(funding_total) AS avg_2012\n    FROM company\n    WHERE EXTRACT(YEAR FROM CAST(founded_at AS DATE)) = '2012'\n    GROUP BY country),\nyear_2013 AS (\n    SELECT\n        country_code AS country,\n        AVG(funding_total) AS avg_2013\n    FROM company\n    WHERE EXTRACT(YEAR FROM CAST(founded_at AS DATE)) = '2013'\n    GROUP BY country)\n\nSELECT\n    year_2011.country,\n    year_2011.avg_2011,\n    year_2012.avg_2012,\n    year_2013.avg_2013\nFROM year_2011 \n     JOIN year_2012 ON year_2011.country = year_2012.country\n     JOIN year_2013 ON year_2011.country = year_2013.country\nORDER BY year_2011.avg_2011 DESC\n"